brew "ast-grep"
brew "azure-cli"
brew "bat"
brew "cmatrix"
brew "lima"
brew "colima"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "go"
brew "htop"
brew "imagemagick"
brew "lazydocker"
brew "lazygit"
brew "luarocks"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "mas"
brew "neovim"
brew "nuget"
brew "powerlevel10k"
brew "prettier"
brew "ripgrep"
brew "speedtest-cli"
brew "sqlcmd"
brew "sqlfluff"
brew "stow"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "watch"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
cask "1password-cli"
cask "alt-tab"
cask "azure-data-studio"
cask "chatgpt"
cask "discord"
cask "elgato-stream-deck"
cask "elgato-wave-link"
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "git-credential-manager"
cask "gpg-suite"
cask "hiddenbar"
cask "itsycal"
cask "jetbrains-toolbox"
cask "keycastr"
cask "kitty"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "obsidian"
cask "postman"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "zed"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
